<template>
  <div class="ml-1.5 w-[80%]">
    <h1>Пользовательское соглашение</h1>
    <p>
      Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует отношения между владельцем botany-calc.ru/
      (далее Биологический калькулятор или Администрация) с одной стороны и пользователем сайта с другой. Сайт
      Биологический калькулятор не является средством массовой информации.
    </p>
    <p>
      Используя сайт, Вы соглашаетесь с условиями данного соглашения. Если Вы не согласны с условиями данного
      соглашения, не используйте сайт Биологический калькулятор !
    </p>
    <h1>Предмет соглашения</h1>

    <p>Администрация предоставляет пользователю право на размещение на сайте следующей информации:</p>
    <ul>
      <li>Текстовой информации</li>
      <li>Фотоматериалов</li>
    </ul>

    <h1>Права и обязанности сторон</h1>
    <p>Пользователь имеет право:</p>
    <ul>
      <li>осуществлять поиск информации на сайте</li>
      <li>получать информацию на сайте</li>
      <li>создавать информацию для сайта</li>
      <li>использовать информацию сайта в личных некоммерческих целях</li>
    </ul>

    <p>Администрация имеет право:</p>
    <ul>
      <li>по своему усмотрению и необходимости создавать, изменять, отменять правила</li>
      <li>ограничивать доступ к любой информации на сайте</li>
    </ul>

    <p>Пользователь обязуется:</p>
    <ul>
      <li>не нарушать работоспособность сайта</li>
      <li>
        не использовать скрипты (программы) для автоматизированного сбора информации и/или взаимодействия с Сайтом и его
        Сервисами
      </li>
    </ul>
    <ul>
      <p>Администрация обязуется:</p>
      <li>
        поддерживать работоспособность сайта за исключением случаев, когда это невозможно по независящим от
        Администрации причинам.
      </li>
      <li>осуществлять разностороннюю защиту учетной записи Пользователя</li>
    </ul>

    <h1>Ответственность сторон</h1>
    <ul>
      <li>администрация не несет никакой ответственности за услуги, предоставляемые третьими лицами</li>
      <li>
        в случае возникновения форс-мажорной ситуации (боевые действия, чрезвычайное положение, стихийное бедствие и т.
        д.) Администрация не гарантирует сохранность информации, размещённой Пользователем, а также бесперебойную работу
        информационного ресурса
      </li>
    </ul>
    <h1>Условия действия Соглашения</h1>
    <p>
      Данное Соглашение вступает в силу при регистрации на сайте. Соглашение перестает действовать при появлении его
      новой версии. Администрация не оповещает пользователей об изменении в Соглашении.
    </p>
  </div>
</template>

<script lang="ts" setup></script>

<style lang="scss" scoped>
h1 {
  font-size: 1.5rem;
  line-height: 2rem;
}

p {
  margin-bottom: 5px;
  margin-left: 10px;
}

ul li:before {
  content: "—";
  position: relative;
  left: -5px;
}

li {
  margin-left: 20px;
}
</style>
